app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `email` = 'nuratyhh@gmail.com'
 LIMIT 1
---
    public function processLogin()
    {
        $session = session();
        $model = new UserModel();
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // Cek apakah email ditemukan di database
        $user = $model->where('email', $email)->first();