app/Controllers/KategoriController.php

SELECT *
FROM `kategori`
---
    public function index()
    {
        $data['kategori'] = $this->kategoriModel->findAll();

INSERT INTO `kategori` (`nama_kategori`) VALUES ('Gelang')
---
    public function store()
    {
        // Validasi input
        // if (!$this->validate([
        //     'nama_kategori' => 'required|min_length[3]',
        // ])) {
        //     return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        // }

        // Simpan data
        $this->kategoriModel->save([
            'nama_kategori' => $this->request->getPost('nama_kategori'),
        ]);

UPDATE `kategori` SET `nama_kategori` = 'Noken'
WHERE `kategori`.`id_kategori` IN ('6')
---
    public function update($id)
    {
        // Validasi input
        if (!$this->validate([
            'nama_kategori' => 'required|min_length[3]',
        ])) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        // Update data
        $this->kategoriModel->update($id, [
            'nama_kategori' => $this->request->getPost('nama_kategori'),
        ]);