app/Controllers/PelangganController.php

SELECT *
FROM `pelanggan`
---
    public function index()
    {
        $data['pelanggan'] = $this->pelangganModel->findAll();